# my_list = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']
# def divide_list(l, n):
#     # 리스트 l의 길이가 n이면 계속 반복
#     for i in range(0, len(l), n):
#         yield l[i:i + n]
# # 한 리스트에 몇개씩 담을지 결정
# n = 1
# result = list(divide_list(my_list, n))
# print(result)

# numbers = ['one', 'two', 'three', 'four', 'five']
#
# for n in numbers:
#     print(n)
from konlpy.tag import Hannanum,Kkma,Komoran,Okt, Mecab

sentece =[
"종이","등산방석",
"종이 팩","아이스 팩",
"금속 캔","보온 보냉 팩",
"고철","옷걸이",
"유리 병","뚜껑",
"플라스틱","상자",
"비닐","쌓인 상자",
"스티로폼","캔 버리는 방법 좀 알려줘",
"불연성 종량제","압착 캔 버리는 방법 좀 알려줘",
'캔',
"종량제","휠체어",
"합성 수지","닭",
"가구","조개",
"생활 용품","복숭아",
"주방 용품","칫솔",
"소형 가전 제품","연필",
"냉난방기","모나미",
"사무기기","호두",
"학습 사무 정보기기","형광등",
"기타","백열전구",
"아이스 박스","가방",
"액자","거실장",
"어항","거울",
"에어컨","게시판 화이트보드",
"실외기","공기 청정기",
"우산","밥상",
"유모차","김치 냉장고",
"의자","난로",
"자전거","냉장고",
"장롱","노트북",
"장식장","다리미",
"전자레인지","다리미 판",
"정수기","도마",
"에어컨","문짝",
"책상","믹서기",
"청소기","바둑판",
"침대","베개",
"커피 포트","벽 시계",
"컴퓨터","변기",
"타이어","복사기",
"탁구대","빨래 건조대",
"피아노","서랍장",
"헤어 드라이어","선풍기",
"헹거","세탁기",
"화분","쇼파",
"환풍기","식탁",
"텔레비전","신발",
"가시","페트병",
"달걀","라벨 제거 페트병",
"티백","테스트",
]
ha = Hannanum()
kkma = Kkma()
okt = Okt()
ko = Komoran()
for idx, val in enumerate(sentece):
    # print(idx, ha.nouns(val))
    print(idx, ko.nouns(val))

    # print("kkma :" ,idx,kkma.nouns(val))  , ha.pos(val)  , ha.pos(val)